hailang88/FT810/FT810-M0516/user/HAL/FT_Gpu_Hal.c
		for (ft_uint32_t i = 0; i < length; ++i) {
			Ft_Gpu_Hal_Transfer8(host, ft_pgm_read_byte_near(&buffer[i]));
		}
		buffer += length;

    	Ft_Gpu_Hal_EndTransfer(host);
		Ft_Gpu_Hal_Updatecmdfifo(host,length);

		Ft_Gpu_Hal_WaitCmdfifo_empty(host);

		count -= length;
	}while (count > 0);
}
#endif
*/

ft_void_t Ft_Gpu_Hal_CheckCmdBuffer(Ft_Gpu_Hal_Context_t *host,ft_uint32_t count)
{
   ft_uint16_t getfreespace;
   do{
	   // FIXME: This can get stuck, non-even is returned in case of coprocessor issue
        getfreespace = Ft_Gpu_Cmdfifo_Freespace(host);
   }while(getfreespace < count);
}
ft_void_t Ft_Gpu_Hal_WaitCmdfifo_empty(Ft_Gpu_Hal_Context_t *host)
{
   while(Ft_Gpu_Hal_Rd16(host,REG_CMD_READ) != Ft_Gpu_Hal_Rd16(host,REG_CMD_WRITE));
   
   host->ft_cmd_fifo_wp = Ft_Gpu_Hal_Rd16(host,REG_CMD_WRITE);
}

ft_void_t Ft_Gpu_Hal_WrCmdBuf_nowait(Ft_Gpu_Hal_Context_t *host,ft_uint8_t *buffer,ft_uint32_t count)
{
	ft_uint32_t length =0, SizeTransfered = 0;   
	ft_uint32_t freeSpace;
	do {                
		length = count;
		 freeSpace = Ft_Gpu_Cmdfifo_Freespace(host);
		if (length > freeSpace){
		    length = freeSpace;
		}

      	Ft_Gpu_Hal_CheckCmdBuffer(host,length);

        Ft_Gpu_Hal_StartCmdTransfer(host,FT_GPU_WRITE,length);
#if defined(FT900_PLATFORM) && !defined(ESD_SIMULATION)
        spi_writen(SPIM,buffer,length);
		buffer += length;

#endif
#if defined(ARDUINO_PLATFORM_SPI) || defined(MSVC_FT800EMU)
		for (ft_uint32_t i = 0; i < length; ++i) {
			Ft_Gpu_Hal_Transfer8(host, buffer[i]);
		}
		buffer += length;
#endif

#ifdef MSVC_PLATFORM_SPI
		; {
#ifdef MSVC_PLATFORM_LIBMPSSE
			SPI_Write(host->hal_handle,buffer,length,&SizeTransfered,SPI_TRANSFER_OPTIONS_SIZE_IN_BYTES);

#endif
#ifdef MSVC_PLATFORM_Lib4222
			ft_uint16_t SizeTransfered16;
			FT4222_SPIMaster_SingleWrite((FT_HANDLE)host->hal_handle, buffer,length,&SizeTransfered16,TRUE);
			SizeTransfered = SizeTransfered16;

#endif
			length = SizeTransfered;
   			buffer += SizeTransfered;
		}
#endif

		Ft_Gpu_Hal_EndTransfer(host);
		Ft_Gpu_Hal_Updatecmdfifo(host,length);

	//	Ft_Gpu_Hal_WaitCmdfifo_empty(host);

		count -= length;
	} while (count > 0);
}

ft_uint8_t Ft_Gpu_Hal_WaitCmdfifo_empty_status(Ft_Gpu_Hal_Context_t *host)
{
   if(Ft_Gpu_Hal_Rd16(host,REG_CMD_READ) != Ft_Gpu_Hal_Rd16(host,REG_CMD_WRITE))
   {
     return 0;
   }
   else
   {
     host->ft_cmd_fifo_wp = Ft_Gpu_Hal_Rd16(host,REG_CMD_WRITE);
     return 1;
   }  
}

ft_void_t Ft_Gpu_Hal_WaitLogo_Finish(Ft_Gpu_Hal_Context_t *host)
{
    ft_int16_t cmdrdptr,cmdwrptr;

    do{
         cmdrdptr = Ft_Gpu_Hal_Rd16(host,REG_CMD_READ);
         cmdwrptr = Ft_Gpu_Hal_Rd16(host,REG_CMD_WRITE);
    }while ((cmdwrptr != cmdrdptr) || (cmdrdptr != 0));
    host->ft_cmd_fifo_wp = 0;
}


ft_void_t Ft_Gpu_Hal_ResetCmdFifo(Ft_Gpu_Hal_Context_t *host)
{
   host->ft_cmd_fifo_wp = 0;
}


ft_void_t Ft_Gpu_Hal_WrCmd32(Ft_Gpu_Hal_Context_t *host,ft_uint32_t cmd)
{
         Ft_Gpu_Hal_CheckCmdBuffer(host,sizeof(cmd));
      
         Ft_Gpu_Hal_Wr32(host,RAM_CMD + host->ft_cmd_fifo_wp,cmd);
      
         Ft_Gpu_Hal_Updatecmdfifo(host,sizeof(cmd));
}


ft_void_t Ft_Gpu_Hal_ResetDLBuffer(Ft_Gpu_Hal_Context_t *host)
{
           host->ft_dl_buff_wp = 0;
}
/* Toggle PD_N pin of FT800 board for a power cycle*/
ft_void_t Ft_Gpu_Hal_Powercycle(Ft_Gpu_Hal_Context_t *host, ft_bool_t up)
{
	if (up)
	{
#ifdef MSVC_PLATFORM
#ifdef MSVC_PLATFORM_LIBMPSSE
            //FT_WriteGPIO(host->hal_handle, 0xBB, 0x08);//PDN set to 0 ,connect BLUE wire of MPSSE to PDN# of FT800 board
	        FT_WriteGPIO(host->hal_handle, (1 << host->hal_config.pdn_pin_no) | 0x3B, (0<<host->hal_config.pdn_pin_no)|0x08);//PDN set to 0 ,connect BLUE wire of MPSSE to PDN# of FT800 board
			
            Ft_Gpu_Hal_Sleep(20);

            //FT_WriteGPIO(host->hal_handle, 0xBB, 0x88);//PDN set to 1
	        FT_WriteGPIO(host->hal_handle, (1 << host->hal_config.pdn_pin_no) | 0x3B, (1<<host->hal_config.pdn_pin_no)|0x08);//PDN set to 0 ,connect BLUE wire of MPSSE to PDN# of FT800 board
            Ft_Gpu_Hal_Sleep(20);
#endif
#ifdef MSVC_PLATFORM_Lib4222
			FT_STATUS status;
		status = FT4222_GPIO_Write((FT_HANDLE)host->hal_handle,GPIO_PORT0,0);
		Ft_Gpu_Hal_Sleep(20);
		status = FT4222_GPIO_Write((FT_HANDLE)host->hal_handle,GPIO_PORT0,1);
		Ft_Gpu_Hal_Sleep(20);

#endif


#endif
#ifdef ARDUINO_PLATFORM      
            P35=0;   
            Ft_Gpu_Hal_Sleep(20);

             P35=1;  
            Ft_Gpu_Hal_Sleep(20);
#endif
#if defined(FT900_PLATFORM) && !defined(ESD_SIMULATION)
            gpio_write(host->hal_config.pdn_pin_no, 0);
            ft_delay(20);
            gpio_write(host->hal_config.pdn_pin_no, 1);
            ft_delay(20);
#endif
	}else
	{
#ifdef MSVC_PLATFORM
#ifdef MSVC_PLATFORM_LIBMPSSE
	        //FT_WriteGPIO(host->hal_handle, 0xBB, 0x88);//PDN set to 1
	        FT_WriteGPIO(host->hal_handle, (1 << host->hal_config.pdn_pin_no) | 0x3B, (1<<host->hal_config.pdn_pin_no)|0x08);//PDN set to 0 ,connect BLUE wire of MPSSE to PDN# of FT800 board
            Ft_Gpu_Hal_Sleep(20);
            
            //FT_WriteGPIO(host->hal_handle, 0xBB, 0x08);//PDN set to 0 ,connect BLUE wire of MPSSE to PDN# of FT800 board
	        FT_WriteGPIO(host->hal_handle, (1 << host->hal_config.pdn_pin_no) | 0x3B, (0<<host->hal_config.pdn_pin_no)|0x08);//PDN set to 0 ,connect BLUE wire of MPSSE to PDN# of FT800 board
			
            Ft_Gpu_Hal_Sleep(20);
#endif
#ifdef MSVC_PLATFORM_Lib4222
		FT4222_GPIO_Write((FT_HANDLE)host->hal_handle,GPIO_PORT0,1);
		Ft_Gpu_Hal_Sleep(20);
		FT4222_GPIO_Write((FT_HANDLE)host->hal_handle,GPIO_PORT0,0);
		Ft_Gpu_Hal_Sleep(20);

#endif
#endif
#ifdef ARDUINO_PLATFORM
             P35=1;  
            Ft_Gpu_Hal_Sleep(20);
            
             P35=0; 
            Ft_Gpu_Hal_Sleep(20);
#endif
#if defined(FT900_PLATFORM) && !defined(ESD_SIMULATION)
            gpio_write(host->hal_config.pdn_pin_no, 1);
            ft_delay(20);
            gpio_write(host->hal_config.pdn_pin_no, 0);
            ft_delay(20);
#endif

